ITHACA-FV/tutorials/CFD/21unsteadyNSTurb_RBF/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


simulationType RAS;

RAS
{
    RASModel        kOmegaSST;
    turbulence      on;
    printCoeffs     on;
}


// simulationType  LES;

// LES
// {
//     LESModel        dynamicKEqn;

//     turbulence      on;

//     printCoeffs     on;

//     delta           cubeRootVol;

//     dynamicKEqnCoeffs
//     {
//         filter simple;
//     }

//     cubeRootVolCoeffs
//     {
//         deltaCoeff      1;
//     }

//     PrandtlCoeffs
//     {
//         delta           cubeRootVol;
//         cubeRootVolCoeffs
//         {
//             deltaCoeff      1;
//         }

//         smoothCoeffs
//         {
//             delta           cubeRootVol;
//             cubeRootVolCoeffs
//             {
//                 deltaCoeff      1;
//             }

//             maxDeltaRatio   1.1;
//         }

//         Cdelta          0.158;
//     }

//     vanDriestCoeffs
//     {
//         delta           cubeRootVol;
//         cubeRootVolCoeffs
//         {
//             deltaCoeff      1;
//         }

//         smoothCoeffs
//         {
//             delta           cubeRootVol;
//             cubeRootVolCoeffs
//             {
//                 deltaCoeff      1;
//             }

//             maxDeltaRatio   1.1;
//         }

//         Aplus           26;
//         Cdelta          0.158;
//     }

//     smoothCoeffs
//     {
//         delta           cubeRootVol;
//         cubeRootVolCoeffs
//         {
//             deltaCoeff      1;
//         }

//         maxDeltaRatio   1.1;
//     }
// }


// ************************************************************************* //
