ITHACA-FV/tutorials/CFD/21unsteadyNSTurb_RBF/0/Developed/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "50";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
23266
(
-1.15668e-06
0.00625116
-2.32218e-06
0.00625117
-3.50605e-06
0.00625118
-4.71289e-06
0.00625121
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform -0.00625;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.00664922
0.00665355
0.00666304
0.00667771
0.00669946
0.00673424
0.00677587
0.00680508
...
)
;
    }
    down
    {
        type            empty;
        value           nonuniform 0();
    }
    up
    {
        type            empty;
        value           nonuniform 0();
    }
    sides
    {
        type            calculated;
        value           uniform 0;
    }
    cylinder1
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
